"""
python 程序设计思维
-计算思维与程序设计
-计算生态与python语言
-用户体验与软件产品
-基本的程序设计模式
"""
'''
计算思维 

-逻辑思维：推理和演绎，数学为代表
-实证思维：实验与验证，物理为代表
-计算思维：设计和构造，计算机为代表（模拟过程）

计算思维
    抽象和自动化
    -计算思维：computationthinking
    -抽象问题的计算过程，利用计算机自动化求解
    -计算思维是基于计算机的思维方式
    
计算思维基于计算机强大的算力以及海量的数据
抽象计算过程，关注设计和构造，而非因果
以计算机程序设计为实现的主要手段

编程是将计算思维变成现实的手段


计算生态与python语言
开源思想深入演化和发展，形成了计算生态
    计算生态以开源项目为组织形式，充分利用“共识原则”和“社会利他”组织人员，在竞争发展、相互依存
和迅速更迭中完成信息技术的更新换代，形成了技术的自我演化路径

-以开源项目为代表的大量第三方库
    python语言提供》13万个第三方库
-库的建设经过了野蛮生长和自然选择
    同一功能下，python语言往往提供两个以上的第三方库（竞争）
-库之间相互关联使用，依存发展
    python库之间广泛联系，逐级封装
-社区庞大，新技术更迭迅速
    AlphaGo深度学习算法采用python语言开源
    
API！（经过设计的产物）= 生态
创新：跟随创新、集成创新、原始创新
    -加速科技类应用创新的重要支撑
    -发展科技产品商业价值的而重要模式
    -国家科技体系安全和稳固的基础
    
计算生态的应用
刀耕火种-》站在巨人的肩膀上
    -编程的起点不是算法而是系统
    -编程如同搭积木，利用计算生态位主要模式
    -编程的目的是快速解决问题
    

优质的计算生态
推荐榜  http://python123.io
看见更大的世界，遇见更好的自己

用户体验
实现功能    -> 关注体验
-用户体验指用户对产品建立的主观感受和认知
-关心功能的实现，更要关心用户的体验，才能做出好的产品
-编程只是手段，不是目的，程序最终为人类服务

方法一：进度展示
    -如果程序需要计算时间，可能产生等待，请增加进度展示
    -如果程序有若干步骤，需要提示用户，请增加进度展示
    -如果程序可能存在大量次数的循环，请增加进度展示
方法二：要学会异常处理
    -当获得用户输入，对合规性需要检查，需要异常处理
    -当读写文件时，对结果进行判断，需要异常处理
    -当进行输入输出时，对运算结果进行判断，需要异常处理
其它类方法：
    -打印输出：特定位置，输出程序运行的过程信息
    -日志文件：对程序异常及用户使用进行定期记录
    -帮助信息：给用户多种方式提供帮助信息
    
软件程序--》软件产品
用户体验是程序到产品的关键环节
'''
















